#!/usr/bin/env python3
# -*- coding: utf-8 -*-

#Составить программу, выясняющую делится ли натуральное число нацело на натуральное число .

a = int(input("First"))
b = int(input("Second"))
if a%b==0:
    print("Yes")
else:
    print("No")